<template>
	<div class="Background SubjectIntroductionContainer">
		<div class="Heading" style="font-size: 2.5vw">学科简介</div>
		<div class="Text">
			<div v-for="(item, index) in Paragraphs" :key="index">
				<div class="Paragraph">&emsp;&emsp;{{ item }}</div>
			</div>
		</div>
	</div>
</template>

<script>
export default {
	name: "SubjectIntroduction",
	data() {
		return {
			Paragraphs: [
                "北京大学外国语学院的历史可以追溯到1862年成立的京师同文馆。京师同文馆是当时的国立外国语学院，也是北京大学外国语学院的前身之一。1898年，北京大学的直接前身京师大学堂成立。成立伊始，京师大学堂即开设英、法、德、俄、日5个语种的课程。1900年，京师大学堂暂时停办。1902年，京师大学堂复学，并随即合并了京师同文馆，次年更名为译学馆。北京大学外国语学院的两个最早的前身从此融为一体。1919年，北京大学废门改系，组建13个系，其中外国文学系有3个，即英国文学系、法国文学系、德国文学系。1920年，俄国文学系成立，使外国文学系在全校的18个系中占4个。在当时的学科结构中，外国文学系占有较大的比重，说明外国文学学科在北大具有重要的地位。1924年，北京大学决定添设“东方文学系”，但所谓“东方文学系”其实只有日文专业，由周作人担任系主任。俄文系后来被取消，1931年成立的外国语文学系由英、法、德、日四个语种组成。西南联大期间，也一直保持了外国语文学系的建制。在很长一段时间，北京大学的外国语言文学学科以西方语言文学为主体，除有英、法、德、俄等专业之外，还开设拉丁语和古希腊语课程。北大也一直重视东方语言文学的教学，除很早就设有日语专业外，还于1919年即开始教授梵文课程。但由于条件所限，直到1946年季羡林先生从德国学成归国后，拥有多个语种的东方语文学系（以下简称东语系）才得以成立。建系初期，拥有6位教师的东语系可以教授梵文、阿拉伯文、蒙文、藏文等语言。从那时起，北大乃至中国的东方学科才正式建立并得到长足的发展。",
                "在本学科的历史上，曾汇聚了我国最优秀的一批外国语言文学学者，可谓群星荟萃、大师云集。20世纪初到新中国成立前，在本学科工作过的知名学者包括：陈衡哲、陈逵、陈钦仁、陈源、辜鸿铭、顾孟余、胡适、蒯淑平、梁实秋、梁宗岱、林语堂、罗昌、罗念生、钱稻孙、孙大雨、王文显、温源宁、徐志摩、徐祖正、燕卜逊、杨荫庆、杨震文、杨宗翰、叶公超、郁达夫、张欣海、周作人等。在西南联大时期，还有陈嘉、柳无忌、钱钟书、吴宓等学者。新中国成立后仍在北大工作的老一辈学者包括：卞之琳、曹靖华、陈占元、冯至、季羡林、金克木、李赋宁、马坚、潘家洵、田德望、闻家泗、吴达元、杨业治、杨周翰、俞大铟、赵萝蕤、赵诏熊、朱光潜等。"
            ],
		};
	},
};
</script>

<style scoped>
.SubjectIntroductionContainer {
	position: relative;
	height: 90vw;
	display: block;
}
.Text {
	position: relative;
	width: 80vw;
	top: 15vw;
	left: 0;
	right: 0;
	margin: auto;
	display: flex;
	flex-direction: column;
}
.Paragraph {
	position: relative;
	font-size: 1.5vw;
	line-height: 200%;
}
</style>